{"meta":{"title":"KyneSilverhide","subtitle":"Sharing some of my developper experiences to the world","description":"Description of the blog","author":"KyneSilverhide","url":"http://kynesilverhide.github.io"},"pages":[{"title":"Categories","date":"2016-12-01T18:26:30.750Z","updated":"2016-11-26T13:25:34.000Z","comments":true,"path":"categories/index.html","permalink":"http://kynesilverhide.github.io/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2016-12-01T18:26:30.750Z","updated":"2016-11-26T13:25:45.000Z","comments":true,"path":"tags/index.html","permalink":"http://kynesilverhide.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"DIY Arcade Controller","slug":"DIY-Arcade-Controller","date":"2017-03-12T11:39:45.000Z","updated":"2017-03-12T14:48:10.464Z","comments":true,"path":"2017/03/12/DIY-Arcade-Controller/","link":"","permalink":"http://kynesilverhide.github.io/2017/03/12/DIY-Arcade-Controller/","excerpt":"Do you still have your raspberry somewhere on your desk or near your TV? Great ! Because we can go to the next level and build our own arcade controller with an embedded console.How? By putting the raspberry itself inside our arcade stick !","text":"Do you still have your raspberry somewhere on your desk or near your TV? Great ! Because we can go to the next level and build our own arcade controller with an embedded console.How? By putting the raspberry itself inside our arcade stick ! First and foremost, this guide will be slightly different than the previous ones, mainly because it won’t be as detailed. I’ll provide as many information as possible on each steps, but depending on the materials and skills at disposal, you may choose a completely different solution. I also forgot to take pictures of the building processed, but provided a link to someone else’s guide that is very similar. What we will build This arcade controller (or stick) is basically a box, some holes, a joystick, buttons, and a raspberry pi attached together. Based on your skills, you can either build the box yourself, use metal, re-use a cheap plastic controller, or even build it with legos or transparent glass. What do we need An arcade kit (buttons, cable, joystick, encoder) OR separate parts A Raspberry Pi A long HDMI cable (unless you want to play close to your screen, I picked a 3m long cable) A long power adapter (cheap models may not work with very long cable, so I picked a 2m long cable and checked it was compatible with a Raspberry Pi 3) The arcade kit This is the part where you’ll have to choose what kind of buttons you want, and balance price and quality.Typically, there are two “families” of buttons and sticks : American ones (HAPP, and Japanese ones (Sanwa, Seimitsu…).American buttons are concave, and the sticks looks like a car shift. Japanese buttons are convex, while their sticks is literally a ball on a shaft. To plug all these buttons, the easiest way is to use and USB encoder. This will allow you to plug all your buttons and sticks into a small board with an USB output. In theory, you can mix and match these buttons and sticks, as long as the encoder supports both (Japanese joysticks use a single pin connector, while HAPP joysticks use four smaller connectors). There are tons of kits available. If you want the best quality, you’ll have to buy the more expansive Sanwa, Seimitsu and HAPP parts. If, like me, you first want to try things without investing too much money, you’ll probably find what you want on Amazon or Ebay. If you want, buttons can also come equipped with LEDs. If you stick to 5V LEDs, you should be able to power them via the USB port of your raspberry. Some kits use 12V LEDs that will require a dedicated power supply, so I strongly recommend to only buy these if you want to build a bartop cabinet instead. I myself bought this kit on Ebay.I was very satisfied with the quality, relatively fast shipping (from China to Belgium), and support from the seller. Unfortunately, three of the eleven (10 and 1 spare) LEDs were not working. I contacted the seller and they sent me new LEDs that should arrive soon. Pick a stick You can pick any stick you want, as long as you choose a compatible USB encoder (see below). Based on your preferences, you can have a look at (or replace later) the restrictor gate (there are multiple shapes : a circle, a square, a line, an octogon…). Pick buttons Buttons also come in many shapes : concave, convex, large or small, with or without a LED. Some can be screwed in, some have to be snapped in.If you are working with thick wood planks, ensure the button is high enough. Most buttons requires 28-30mm holes, while smaller ones usually fit into a 24mm hole (you may need to convert into inches…). Be very careful : Find how many buttons you need. While SNES games only requires 8 buttons, you may need a bit more for other consoles. Most kit will include 10 buttons. This will allow you to emulate X, Y, A, B, L1, R1, L2, R2, Start and Select. If you are using Recalbox (my tutorial here, more information here), you’ll need another “hotkey” button. I decided to switch to Retropie instead, because they use a “Start + Select” combination instead. Or you can simply get rid of the “L2” and “R2” buttons. I decided to go “full on bling” with these 5V led “chrome” buttons. Pick an USB encoder Unless you want to get the top quality encoder to ensure your SNES game won’t have a pico-second input delay, any encoder is fine. Double-check that the pins are compatible with your joysticks, and support enough buttons (most encoder, even cheap ones, support up to 12 buttons, and both joystick types).Pick one that is bundled with the proper USB cable, to make things easier. Don’t forget the cables If you are buying a kit, everything should be OK. Otherwise, you’ll need to do the wirings yourself. I’ve included a schema of my encoder below. Note that basic buttons only requires two wires (5V and ground), while LED buttons will require four wires (5V Led, 5V button, led ground, button ground).Sometimes, the wires will all be attached to a single connector. Sometimes, you’ll have to make a daisy chain plugged to the encoder “ground”. You should find proper instructions with your USB encoder. Instructions With Ikea components If you want the easy way, someone on the internet decided to do the same thing, but using IKEA parts for the box.You can find detailed informations on its website : http://bambooarcade.com/ “Simply” follow the instructions and you should be good. With anything else If you want to improvise, you’ll need to build a big-enough box and print some button layouts.I used the same layout as the one posted in the IKEA section (http://bambooarcade.com/downloads/), but I changed the button position slightly using Adobe Illustrator (there is a 7 days trial). You should be able to use Inkscape on Ubuntu if you want to edit the layout. Otherwise, simply use the PDFs from the download section. If you print this layout, make sure you don’t use any zoom, custom margins or “fit to page” options. You can check that the layout is properly printed by using the included scale (there are two 125mm lines, horizontal and vertical, on the layout). First, I used some wood plank, put the layout on top, and drilled the holes my marking the center first (use a screwdriver)Then, I put everything together to test the buttons. You can use this HTML5 website to test that everything works. Then, I decided to scale down the board to fit a simple A4 sheet of paper (more or less…).Don’t worry, you can fit everything inside, even with large buttons and four cables each.I then built a wooden box and painted it black. I kept a hole on the side (see below) to be able to access the Raspberry Pi USB, HDMI and power plugs. I was not very happy with the black painting, so I decided to use some vinyl overlay. At first, I wanted to design my own overlay, but I struggled to find a way to print it without ordering from the USA. I also had problems with colors, as most of these services are related to advertising, and requires specific color profiles. So in the end, I went for a “fake carbon” overlay, such as this one.I covered the top board, and used blades to cut the holes. Then, I screwed back the buttons, the USB encoder, the stick, and the Raspberry Pi on the side. Be careful, if your screws are longer than the thickness of the board, you may need to use screw washers. Finally, I attached all the cables and… Wow, that’s a mess. As you can guess, using the provided cables is very easy, but none of them has the optimal length. In the end, I don’t care at all, because all of this will be hidden, and I don’t really want to bother with cable management.I just had to close back the box, screw the top board, and everything was ready for the final test. Final steps I plugged my HDMI cable to my TV, then to the Raspberry, and did the same with the power plug.Retropie booted with no problem and started installing by itself. I configured each buttons, copied some games using an USB stick, and tested right away.I was very pleased to see that everything works as expected :) If I had to do it again, would I follow the same steps? Yes, probably. But there are indeed some minor things that are not perfect. First, the cables are a mess. It doesn’t matter, as I didn’t even bother to paint the inside of the box, and I don’t want to use custom cables. The buttons works fine, but are a bit hard to push. I may buy better microswitches later on, at least for the most used buttons. The provided USB cable is very long, because it’s supposed to be plugged to a consoler near the TV, not just next to the encoder itself. This is fine, because I let the cable outside the box, and directly into one of the USB ports. In theory, I should be able to unplug the controller, and plug it back to my computer, another Raspberry, or a console (but I don’t think the default button mapping will be practical). I can even plug a gamepad for specific games, or for multiplayer games. The box is not perfect, but I’m very happy with the final size and weight. I could have used plexiglass on top of the vinyl overlay. But this works better if the top board is a bit lower than the side planks. I hope this tutorial will help you choose the right parts and build your own arcade controller.","categories":[{"name":"Gaming","slug":"Gaming","permalink":"http://kynesilverhide.github.io/categories/Gaming/"},{"name":"Raspberry Pi","slug":"Gaming/Raspberry-Pi","permalink":"http://kynesilverhide.github.io/categories/Gaming/Raspberry-Pi/"}],"tags":[{"name":"retropie","slug":"retropie","permalink":"http://kynesilverhide.github.io/tags/retropie/"},{"name":"arcade","slug":"arcade","permalink":"http://kynesilverhide.github.io/tags/arcade/"},{"name":"diy","slug":"diy","permalink":"http://kynesilverhide.github.io/tags/diy/"},{"name":"controller","slug":"controller","permalink":"http://kynesilverhide.github.io/tags/controller/"},{"name":"stick","slug":"stick","permalink":"http://kynesilverhide.github.io/tags/stick/"}]},{"title":"Exporting a VirtualBox image to VMWare","slug":"Exporting-a-VirtualBox-image-to-VMWare","date":"2016-12-21T13:11:09.000Z","updated":"2016-12-21T14:15:35.031Z","comments":true,"path":"2016/12/21/Exporting-a-VirtualBox-image-to-VMWare/","link":"","permalink":"http://kynesilverhide.github.io/2016/12/21/Exporting-a-VirtualBox-image-to-VMWare/","excerpt":"In the first posts, I showed you how to install Ubuntu in VirtualBox. I did choose VirtualBox because the installation didn’t seem to work in VmWare Player (Another well know product for creating and running operating systems and applications in a virtual machine). Unfortunately, I also encountered some bugs in VirtualBox whenever I tried to enable 3D acceleration (screenshots were black, and Atom was not starting properly). So after some search, I found out it’s actually quite easy to migrate a working image from VirtualBox to VMWare Player.","text":"In the first posts, I showed you how to install Ubuntu in VirtualBox. I did choose VirtualBox because the installation didn’t seem to work in VmWare Player (Another well know product for creating and running operating systems and applications in a virtual machine). Unfortunately, I also encountered some bugs in VirtualBox whenever I tried to enable 3D acceleration (screenshots were black, and Atom was not starting properly). So after some search, I found out it’s actually quite easy to migrate a working image from VirtualBox to VMWare Player. Exporting from VirtualBox Start VirtualBox, go to the Menu and selected Export Appliance… Simply follow the guide and keep the default values (double check where you want to export the file) At the end, the export will start. Depending on the size of your image, it may takes some time… Importing into VmWare Player Once the export has been successfully completed, it’s time to import it. You can close VirtualBox, and starts VMWare Player.If you have not yet installed VmWare Player, you can download it here : https://my.vmware.com/web/vmware/free#desktop_end_user_computing/vmware_workstation_player/12_0I don’t think VMWare exists on MacOSX, but as I said, you probably won’t need Ubuntu if you are on a Mac. Go to “Open a Virtual Machine” and browse to the exported .ova fileYou’ll probbaly see a warning, but you can ignore it safely, and hit “Retry”The import should start quickly… but once again, the whole process will takes time. Most tutorial will leave you here, with a working image. But even if it starts, it won’t run properly as you were used to. Final Configuration Edit the settings of the imported machine (you can safely delete the exported .ova) by right clicking on the image in the list. Double check the CPU and memory, to ensure the values were properly imported. Add a soundcard to the list (use the default values or pick one if you have multiple soundcards or output ports. In my case, I chose the optical output “SPDIF”) You can also enable 3D acceleration back, and increase the allowed memory to 2Gb (maybe more, maybe less, depending on your hardware) in the “Display” section. You should also probably add USB controller support, just in case you need to plug an external device. Switch to the other tab and add your shared folders. Starting the machine You should now be able to start your Ubuntu machine. I a dialog appears, choose “I copied it”.If everything went fine, you should have your environment back.I recommend to install the VMWare tools from the VMWare Menu (note that in my case, the option has switched to “Update”, because I already installed everything before). Ubuntu should automatically mount the tools CD-ROM. Copy the archive somewhere else on your desktop, and extract it (you can simply right click, you don’t need to use the terminal).Finally, open the terminal, go to the extracted folder and run the second command 12 cd ~/path/to/extracted/tools/sudo vmware-config-tools.pl You should keep the default answer to all questions. Note that the very first question will probably recommend you to use install from a package instead, but most tutorials are still using the old version, so I decided to do the same. Once finished, you should probably restart Ubuntu. Shared folders tweak In my case, Shared folders didn’t work, even after a restart.I had to run this command to reconfigure the VMWare Tools with the proper driver 1 sudo vmware-config-tools.pl -d --clobber-kernel-modules=vmhgfs Once done, simply go to /mnt/hgfs/ using the File Explorer, and you’ll find your shared folders.You can them drag&amp;drop the folder to the left menu, in order to create a shortcut. Broken resolution? In my case, my resolution (1920*1080) didn’t appear in Ubuntu, so I had to choose between a tiny window, or something too large.I manually created a custom resolution, but I’m not sure this is the proper fix. Anyway, if you encounter the same problem, you can run these commands.first, use cvt, followed by the height, width and refresh rate. 1 cvt 1920 1080 60 Paste the value returned by the first command, starting after “Modline” 123 xrandr --newmode &quot;1920x1080_60.00&quot; 173.00 1920 2048 2248 2576 1080 1083 1088 1120 -hsync +vsyncxrandr --addmode Virtual1 &quot;1920x1080_60.00&quot;xrandr --output Virtual1 --mode &quot;1920x1080_60.00&quot; If Virtual1 is not your display name, simply type xrandr with no parameter to print your display name.Your new resolution should now be applied, and listed in the “System Settings &gt; Display” menu. Conclusion Congratulations, you now have another Ubuntu machine with proper 3D acceleration.For now, everything seems to work as expected, but the boot is slower on my machine. I’ll continue investigating to see if it’s normal, or if I messed up something in the configuration.","categories":[{"name":"Virtualization","slug":"Virtualization","permalink":"http://kynesilverhide.github.io/categories/Virtualization/"}],"tags":[{"name":"virtualbox","slug":"virtualbox","permalink":"http://kynesilverhide.github.io/tags/virtualbox/"},{"name":"vmware","slug":"vmware","permalink":"http://kynesilverhide.github.io/tags/vmware/"},{"name":"migration","slug":"migration","permalink":"http://kynesilverhide.github.io/tags/migration/"}]},{"title":"A cheap retro-gaming solution : the Raspberry PI (Part 2)","slug":"A-cheap-retro-gaming-solution-the-Raspberry-PI-Part-2","date":"2016-12-19T16:59:57.000Z","updated":"2016-12-19T18:36:35.603Z","comments":true,"path":"2016/12/19/A-cheap-retro-gaming-solution-the-Raspberry-PI-Part-2/","link":"","permalink":"http://kynesilverhide.github.io/2016/12/19/A-cheap-retro-gaming-solution-the-Raspberry-PI-Part-2/","excerpt":"Welcome back to this second part of the retro-gaming tutorial. Now that we have a working Raspberry, let’s install RecalBox. Recalbox (or RecalBoxOS should I say) is a free, open source operating system designed to work on Raspberry machines (and equivalent). Basically, it’s a bundle of emulators to play almost any old games, with a very user friendly interface on top of it, designed to be used on a TV.","text":"Welcome back to this second part of the retro-gaming tutorial. Now that we have a working Raspberry, let’s install RecalBox. Recalbox (or RecalBoxOS should I say) is a free, open source operating system designed to work on Raspberry machines (and equivalent). Basically, it’s a bundle of emulators to play almost any old games, with a very user friendly interface on top of it, designed to be used on a TV. Getting RecalBox First, you’ll have to download RecalBox from here : https://github.com/recalbox/recalbox-os/releases. Simply pick the last .zip file and download it somewhere on your computer.Next, you’ll need to plug your micro SD card in a card slot, or some kind of card reader. In my case, I have this small USB device that can read a lot of formats.As I said in the previous post, you’ll only need this once, so if you don’t have one, you may be able to borrow it. This will remove everything from your card. You may have to double-check that you did backup all your photos first, or whatever content that may have been on the card.On Windows and MAC, you can format your card using SD Card Formatter 4.Note that I don’t know why Windows is listing my 32Gb card as a “600Mb” USB device… On Ubuntu, you can use GParted. Simply pick “Fat32” and start the process.Once the card is empty, unzip the .zip you downloaded before onto the card (it should appear in your File Explorer). Once the process is finished, simply plug the card back into the Raspberry PI. Check one last time that your gamepad is plugged. If you are using an Ethernet connection, you shouldn’t have any problem. If you are using the WiFi, you’ll need one USB Keyboard to type in the WiFi SSID and password. Starting Recalbox Once the power supply is plugged, the Raspberry will start, and Recalbox will install. The installation shouldn’t require any input, so just wait a bit.Unfortunately, I didn’t find how to take screenshot from Recalbox (if you are not running a game), so instead, I had to take photos with my smartphone…As you will see, the picture quality is just average when directly aiming at my monitor, even if the room is fully lit. If everything went fine, you’ll see the main screen. Note that you will only see consoles (well.. emulators) if you have at least one game installed. By default, Recalbox comes with some free games, so you should see at least one or two consoles listed. Controller Most USB gamepads should be recognized, and some buttons should work out of the box, to navigate though the menus. If not, use an USB keyboard and/or mouse.The first step is to configure our gamepad. Hit START to open the main menu. Go to Controller settings, and then choose Configure a controller (with my wired Xbox controller, A was used to confirm, while B was used to cancel or go back). Simply follow the on-screen instructions, and press each matching buttons. If the button is recognized, the configuration wizard will move to the next row. Once this is done, you should be able to change the INPUT P1 from the Controller settings to your custom configuration (screenshot “Controller settings”) Graphics Go back to the main menu and choose Game Settings. Here is my configuration, but feel free to change it to match your liking. You can even enable filters to change your brand new widescreen LED TV to an old CRT with scanlines. Sound If you want, you go to Sound settings an disable the music from playing in the main menu. UI In UI Settings, you can tweak the menus a bit. Here is my configuration (I don’t think I changed anything). Network This is important if you want your Raspberry to connect to your network. (This will allow you to update RecalBox from the interface, but also send new games from your computer to the Raspberry, or edit configuration files directly).With a wired connection, everything should work fine, but with WiFi, you’ll have to type the proper SSID and password from your router.RecalBox should automatically connect once the proper values have been entered. Copying and games If you didn’t connect your Raspberry to your network, you’ll have to remove the SD card each time to drop the new games in the proper folder. But if everything worked fine, you can simply connect to your Raspberry by its IP (you should find the IP in your router administration, where all connected devices are listed).On Ubuntu, you can also simply type in a terminal 1 nmap -sn 192.168.1.0/24 The Raspberry PI should be listed (but also all your computers, TVs, smartphones, etc.). If you are not sure, you can test all the entries. In my case, the IP is 192.168.1.18. You can now access the Raspberry in your web browser, by opening http://192.168.1.18 (use your IP, of course)If you open the “Manage Rom files for emulated systems“ section, then pick a console, you should be able to upload games directly. But where can I find games? Well, as you may have imagined, these games are mostly illegal copies, so I won’t give you any link from this blog (in theory, you can legally own any of these copies if you own the original game). But, it’s very easy to find them, if you know what you are looking for. Games running on emulators are stored as “Roms“. Any Google search of this word and the proper console next to it should be more than enough. Note that while I can’t give you direct links, I can also point you in the proper direction. Simply search for “Emuparadise” or “RomStation” (fr). Alternative to the web browser On Windows, you can use WinSCP to connect to Recalbox. Simply type the IP, choose root as the login/username, and recalboxroot as the password (this is the default password for RecalBox).You can now open the recalbox/share/roms folder and open the directory matching the system you want to use. On Ubuntu, simply open the File Explorer, press CTRL + L to edit the address, and type in ssh://192.168.1.18 (use your own IP). You’ll be prompted for the login and password, use the same as above. Once the files are copied to the proper folder (I won’t detail which formats are supported, but let’s say that nearly ALL formats are supported, unless you find something very exotic), you can go back to your Raspberry, open the Main Menu, Go to “Game settings”, and choose Update Games List at the very bottom of the list (or you can also restart the Raspberry). Then, pick any of the system, and you should see all your games (see below for the game thumbnails). Scraping games If you want to see the thumbnails and details, you’ll have to Scrape the games. This means RecalBox will query a game database to fetch informations and display them in the interface. From the Main Menu, go to Scraper, ensure you are scraping from “THEGAMESDB”, and choose Scrape Now.Check that all your systems are selected, and start the scraping. This may take some time, and some results may be inaccurate, requiring you to manually search for the games (so you’ll need your keyboard). Achievements Recalbox also supports retro achievements from http://retroachievements.org/. You can link your account from the options. I didn’t test it, but it will enable achievements on supported games, to keep track of your progression. Final notes If you want to turn off the Raspberry Pi, it’s very important to first go to the main Menu, ans select “Quit”, then “Shutdown System”. Once your screen goes black (or your TV switches to another input), you can safely disconnect the power supply from the Raspberry. This concludes the Retrogaming tutorial. I hope you will have as much fun as I had by playing old games I used to play as a kid.I will also explain to you, in another tutorial, how you can convert your Raspberry PI as a very powerful media center, using Kodi. You can even keep RecalBox installed if you don’t want to switch to another SDCard.","categories":[{"name":"Gaming","slug":"Gaming","permalink":"http://kynesilverhide.github.io/categories/Gaming/"},{"name":"Raspberry Pi","slug":"Gaming/Raspberry-Pi","permalink":"http://kynesilverhide.github.io/categories/Gaming/Raspberry-Pi/"}],"tags":[{"name":"Raspberry","slug":"Raspberry","permalink":"http://kynesilverhide.github.io/tags/Raspberry/"},{"name":"recalbox","slug":"recalbox","permalink":"http://kynesilverhide.github.io/tags/recalbox/"},{"name":"retrogaming","slug":"retrogaming","permalink":"http://kynesilverhide.github.io/tags/retrogaming/"},{"name":"pi","slug":"pi","permalink":"http://kynesilverhide.github.io/tags/pi/"},{"name":"gaming","slug":"gaming","permalink":"http://kynesilverhide.github.io/tags/gaming/"}]},{"title":"A cheap retro-gaming solution : the Raspberry PI (Part 1)","slug":"A-cheap-retro-gaming-solution-the-Raspberry-PI-Part-1","date":"2016-12-14T18:51:07.000Z","updated":"2017-03-12T12:57:29.982Z","comments":true,"path":"2016/12/14/A-cheap-retro-gaming-solution-the-Raspberry-PI-Part-1/","link":"","permalink":"http://kynesilverhide.github.io/2016/12/14/A-cheap-retro-gaming-solution-the-Raspberry-PI-Part-1/","excerpt":"You may already know that Nintendo recently released the Nintendo Classic Mini, a smaller re-edition of the original NES, but with a limited set of pre-installed games. The Nintendo Classic Mini: Nintendo Entertainment System is a miniaturised version of the groundbreaking NES, originally released in Europe in 1986.Just plug the Nintendo Classic Mini: Nintendo Entertainment System into your TV, pick up that grey controller, and rediscover the joy of NES games – in high definition at 60 Hz! Now, what if I told you that there are other reliable, (cheaper?), easy to setup, alternatives? Yes, that’s right, and it’s called the Raspberry Pi. But instead of letting you play some NES games, this will actually allow you to play any NES, Super NES, Gameboy, GBA, NeoGeo, .. and even Playstation games. And this will only cost you around 70$ (unfortunately, it will also cost 70€ if you are from Europe like me, so it’s a bit more expensive).You will even be able to use the Raspberry Pi as a media center, if you are tired of playing games. As you have probably seen, this tutorial will also be split into multiple parts. The first one will teach you a bit more about the raspberry and how you can set it up. The second part will teach you how to install the proper softwares to dive into the retro-gaming madness.","text":"You may already know that Nintendo recently released the Nintendo Classic Mini, a smaller re-edition of the original NES, but with a limited set of pre-installed games. The Nintendo Classic Mini: Nintendo Entertainment System is a miniaturised version of the groundbreaking NES, originally released in Europe in 1986.Just plug the Nintendo Classic Mini: Nintendo Entertainment System into your TV, pick up that grey controller, and rediscover the joy of NES games – in high definition at 60 Hz! Now, what if I told you that there are other reliable, (cheaper?), easy to setup, alternatives? Yes, that’s right, and it’s called the Raspberry Pi. But instead of letting you play some NES games, this will actually allow you to play any NES, Super NES, Gameboy, GBA, NeoGeo, .. and even Playstation games. And this will only cost you around 70$ (unfortunately, it will also cost 70€ if you are from Europe like me, so it’s a bit more expensive).You will even be able to use the Raspberry Pi as a media center, if you are tired of playing games. As you have probably seen, this tutorial will also be split into multiple parts. The first one will teach you a bit more about the raspberry and how you can set it up. The second part will teach you how to install the proper softwares to dive into the retro-gaming madness. Introduction So, before starting any further, I want to assure you that you don’t need any special knowledge for this tutorial. While it may look a bit scary, the Raspberry Pi is just a small computer. It actually looks like this (with no case) : For this tutorial, I will recommend the last edition of the Raspberry Pi, called the Pi 3 Model B.Here are the specifications : A 1.2GHz 64-bit quad-core ARMv8 CPU 802.11n Wireless LAN Bluetooth 4.1 1GB RAM 4 USB ports Full HDMI port Ethernet port Combined 3.5mm audio jack and composite video Micro SD card slot If you own a Raspberry Pi 2 Model B, this tutorial still works but the Model 3 has built-in WiFi, and is a bit more powerful. What do I need? Of course, you’ll need a Raspberry Pi. But you’ll also need some other stuff : An HDMI cable to connect your Raspberry Pi to your TV A power plug, because it doesn’t run on awesomeness alone A Micro SD Card (8Gb or more) An USB Gamepad (wireless gamepads may not work) (optional) a Raspberry Pi case (optional) An USB Keyboard (just once, to setup the WiFi) (optional) An USB mouse (the gamepad should be enough in all situations) (optional) An ethernet cable (if you don’t have WiFi, or don’t want to use it) Here is a schema that will show you how the Raspberry will be connected Where can I get this? You can buy these one by one, or just buy a pack from Amazon. This will ensure you buy the proper power plug and case format. Amazon.fr : https://www.amazon.fr/Vilros-Raspberry-Pi-Complete-Starter/dp/B01DC6MKAQ/ref=sr_1_2?ie=UTF8&amp;qid=1481889791&amp;sr=8-2&amp;keywords=raspberry+pi+3 Amazon.uk : https://www.amazon.co.uk/Vilros-Raspberry-Pi-Complete-Starter/dp/B01D0BKLZY/ref=sr_1_7?ie=UTF8&amp;qid=1481889825&amp;sr=8-7&amp;keywords=raspberry+pi+3 Amazon.com : https://www.amazon.com/Vilros-Raspberry-Media-Center-Kit/dp/B01CYX4HRM/ref=sr_1_1?s=pc&amp;ie=UTF8&amp;qid=1481889863&amp;sr=1-1-spons&amp;keywords=raspberry+pi&amp;psc=1 There are a lot of other packs and websites, but these few should help you find exactly what you need. But.. I need to build it? Not really. Installing the Raspberry Pi only requires you to plug the cables. I recommend to use a case (the transparent one from the pack for example) to protect the components (even from dust). Some packs will pack a pre-installed Micro SD Card, but we will format it anyway in the next part. So feel free to use it for now, or wait a bit more. The first step is to put the Raspberry into the case. I also recommend to screw it to the lower part. Then, if you have some, you can put the small heatsinks on the top chips. It won’t do much, but it was probably in the pack, so why not. (You don’t need thermal paste) Close the case, and put the SD card in the bottom slot (depending on the case you may want to do it before for easier access) Plug the HDMI Cable to your TV or monitor (If you are not using HDMI, you can also plug in your analogue TV or display, but you’ll need to use the audio jack for sound) Plug you USB Gamepad to any of the USB slots Plug the power supply. The Raspberry Pi will starts automatically (there are no ON/OFF buttons, so you’ll need to unplug it to shut it down. You can also use some kind of multi sockets with an ON/OFF button on it) If needed, plug an USB keyboard into any of the available USB slots. If you don’t want to (or simply can’t) use WiFi, plug the ethernet cable to your router (probably next to where your computer is plugged). If this is too far, you can buy a gigabit switch and one more ethernet cable (I had to do the same, not for the Raspberry, but for my Android TV, because my computer is at one end of a room, my TV on the opposite side, and the router is simply on another floor).Simply plug the switch to the power supply, and run a cable from your modem/router to your switch. Then, plug two cables, one from the switch to your computer, and the second cable from the switch to your Raspberry pi. Use straight “cat6” cables (well, it seems that modern switches and router can use both straight and crossover cable), or “cat5” for longer cables. You can find them on Amazon.com (RJ45), simply pick the proper cable length. (Amazon “basics” cables should be available on every other Amazon websites). What’s next? Next, I will show you how to install RecalBox onto your SD Card, and configure it to play some good old games.Here are some screenshots from Recalbox : Don’t worry, the installation is fully automated. The only steps you’ll have to do yourself are copying Recalbox on the SD Card (you will need a card reader, but you’ll only need it once, so you should be able to borrow one) configuring your gamepad(s)We will cover all the details in the next post.","categories":[{"name":"Gaming","slug":"Gaming","permalink":"http://kynesilverhide.github.io/categories/Gaming/"},{"name":"Raspberry Pi","slug":"Gaming/Raspberry-Pi","permalink":"http://kynesilverhide.github.io/categories/Gaming/Raspberry-Pi/"}],"tags":[{"name":"Raspberry","slug":"Raspberry","permalink":"http://kynesilverhide.github.io/tags/Raspberry/"},{"name":"recalbox","slug":"recalbox","permalink":"http://kynesilverhide.github.io/tags/recalbox/"},{"name":"retrogaming","slug":"retrogaming","permalink":"http://kynesilverhide.github.io/tags/retrogaming/"},{"name":"pi","slug":"pi","permalink":"http://kynesilverhide.github.io/tags/pi/"},{"name":"gaming","slug":"gaming","permalink":"http://kynesilverhide.github.io/tags/gaming/"}]},{"title":"Creating a material design wallpaper for your smartphone with GIMP","slug":"Creating-a-material-design-wallpaper-for-your-smartphone-with-GIMP","date":"2016-12-10T17:30:55.000Z","updated":"2016-12-11T20:29:40.759Z","comments":true,"path":"2016/12/10/Creating-a-material-design-wallpaper-for-your-smartphone-with-GIMP/","link":"","permalink":"http://kynesilverhide.github.io/2016/12/10/Creating-a-material-design-wallpaper-for-your-smartphone-with-GIMP/","excerpt":"Material Design is a set of rules defined by Google to build a graphical interface. It was first introduce in June 25, 2014, at the Google I/O conference, and is used since Android 5.0. The goal of Material Design was to build a unified interface and experience across platforms and device sizes. It was built upon a list of principles that I won’t detail here (because that’s not the point of this post), but I can a least give you a summary : Material is the metaphor : each element exists in space, and follow the rules of physics. The background of your application is one giant big sheet of paper, with components lying on top of each other that can rearranged. Bold, graphic, intentional : typography, grids, space, scale and colors create a hierarchy of elements with meaning, and focus Motion provides meaning : motions must be used to focus attention on elements, without breaking the continuity. Transitions are efficient, coherent, and feedback is subtle, yet clear. Using these guidelines, Material Design applications tend to be somehow minimalistic. This is a good opportunity for us to build a wallpaper, as we won’t need much knowledge of the advanced features of Gimp. So let’s dive right into it !","text":"Material Design is a set of rules defined by Google to build a graphical interface. It was first introduce in June 25, 2014, at the Google I/O conference, and is used since Android 5.0. The goal of Material Design was to build a unified interface and experience across platforms and device sizes. It was built upon a list of principles that I won’t detail here (because that’s not the point of this post), but I can a least give you a summary : Material is the metaphor : each element exists in space, and follow the rules of physics. The background of your application is one giant big sheet of paper, with components lying on top of each other that can rearranged. Bold, graphic, intentional : typography, grids, space, scale and colors create a hierarchy of elements with meaning, and focus Motion provides meaning : motions must be used to focus attention on elements, without breaking the continuity. Transitions are efficient, coherent, and feedback is subtle, yet clear. Using these guidelines, Material Design applications tend to be somehow minimalistic. This is a good opportunity for us to build a wallpaper, as we won’t need much knowledge of the advanced features of Gimp. So let’s dive right into it ! But what does Material Design wallpapers looks like? Well, you’ve seen one as the banner of this post, and if you are using an Android device, you’ve probably seen some too.I’m not a very advanced Gimp user, nor am I very talented with design or artistic creations. But anyway, this is my very first wallpaper I made for this blog. The goal is of course to use it on your smartphone, not as a desktop wallpaper.Here are some other samples from the web I do not own any of these pictures, I just found them on http://www.topofandroid.com/ Let’s now learn how we can achieve something similar. Starting with GIMP On Ubuntu, GIMP should be installed by default, but if that’s not the case, let’s do it now : 1 sudo apt-get install gimp On Windows and OSX, you can download GIMP here : https://www.gimp.org/downloads/ Once started, the very first configuration you should do is switch to the “Single Window” mode (at least on Ubuntu, otherwise GIMP will use separate windows for all elements, and that’s definitively not user friendly at all). The next step will be to rearrange the menus a bit. You can drag and drop any tabs from a menu to move it somewhere else. This is the layout I’m using right now : On the top left, all the tools are listed. This is similar to Photoshop (even if the tools are different) On the bottom left, the selected tool options are listed On the top right, I kept the default layout, but I decided to move the “Layers” tab in the bottom right corner. Installing the Material Palette A palette is simply a predefined set of colors. In this case, someone was kind enough to create one with all the recommended colors when working with Material Design. Simply head to https://github.com/KiSSFLOW/gimp-material-design-color-palette and download Material-Design.gpl somewhere on your computer.Then in Gimp : Go to Windows &gt; Dockable Dialogs &gt; Palettes. Once opened, click on configure this tab on the top right corner of the new window, and select Palettes Menu &gt; Import Palette Select the option “Palette file” and browse to the downloaded file The palette should now be listed in the window. Double click on it to open the list of colors Creating a new file To open a new file, simply go to File &gt; New. In this case, I decided to create a 1080 x 1920 (portrait) picture. There are a lot of mobile resolutions, so I decided to take something big enough to support all devices. This won’t matter much in our case, as our wallpaper is mostly made of resizable shapes.Leave everything else to the default value (ensure px is the default unit) and click Ok. Before actually working on the wallpaper, let’s think a bit about what we want. If you have read the Material Design article, you may have found some parts explaining the similitude with paper sheets. This is exactly what we want to do. Put abstract shapes on top of each others, add some shadows, and finally some texture to the shape. Creating a base The very first step will be to choose a background color. In this case, I’m trying to create a green background, so I’ll pick the darkest green from the palette.Use the Bucket Fill Tool (shortcut SHIFT + B) to fill the whole background. Now, one very important step. Each time we want to add a new shape, we first need to create a new layer. Just think of sheet of papers. Each sheet is a new layer. So let’s create a new layer (you can name it if you want, it will be easier to keep all layers organized if they have a proper name) Next we will add our first shape on top. So let’s start with the Rectangle Tool (shortcut : R)Draw any shape you want, then, pick a color from the palette, and click in your shape using the Bucket Fill Tool again. In this case, I choose a lighter green. Now, using the Scale (SHIFT + T) And Rotate (SHIFT + R) tools , let’s rotate our shape by 45° and scale it (if needed). Finally, you can move the shape using the Move Tool (M) Click on the anchor to merge this floating selection with the previously created layer. Now, let’s add some shadow to this first shape. Ensure the shape layer is selected. Go to Filters &gt; Light and Shadow &gt; Drop Shadow. Keep the default settings but deselect “Allow resizing” (offset X and Y = 4, blur = 15, color = black, opacity = 60).Once this is done, Right Click on the first layer (either your shape or the drop shadow), and select merge down. This will ensure both the shape and the shadows are one element (both will move together, etc.) Let’s repeat the same operation with two new shapes. Start with a new layer (each time), then reuse the sames tools as before : Rectangle Tool, Scaling and Resizing tools, Moving Tool, and then anchor the floating selection to the layer.Then, apply the Drop Shadow (note that a shortcut will be added in the Filters menu, so you can reapply the previous effect with the same settings). Don’t forget to also Merge Down the shape and its shadow. Adding complexity To improve our wallpaper, let’s add more shapes and some new colors. Let’s pick the left shape layer, and duplicate it. Using the Bucket Fill Tool, pick a lighter green, and click on your shape. Then, move it to the left. Repeat the operating and duplicate the shape, using a different shade of green each time. Try to add some contrast too. If the shadow is too dark, because two layers are overlapping, simply use the Eraser Tool* (SHIFT + E), select the lower layer that overlaps, and erase the shadow with the eraser.# Adding more complexity…By varying the shapes and colors, you should really start to have something nice. Here are the steps I did. Feel free to copy them, or do something very different.Randomness is also very important. I wanted to add some triangles too. So, using the Free Select Tool, I created a triangle (click once for each vertex), and filled it with another shade of green. Then I duplicated the shape (and its shadow), and picked once again another green. I didn’t really liked the green I choose as contrast, so I went for yellow instead by simply selecting the Bucket Fill Tool, then each layer, and clicking on the surface to repaint. Final adjustments To experiment a bit more, I decided to add a gray circle to the wallpaper. First, let’s create another new layer. Then, using the Ellipse Select Tool, draw a perfect circle by holding the SHIFT key to keep the 1:1 ratio and fill it with gray. Just above the layers, adjust the opacity to 50, and switch the (blending) mode to Hard LightCreate once again a new layer, a new circle, but this time, fill it with white.Set the opacity to 25 and the mode to Overlay I like what we have so far, but I want to give it a more “physical” feel, by adding some texture to the shapes (to mimic real paper).To do that, select a layer and simply go to Filters &gt; Noise &gt; RGB Noise and use these settings I reapplied the same operation (you can hit CTRL + F to reapply the last filter on the select layer) on all green shapes (not the yellow ones).The change is very subtle though. Saving your creation is easy (File &gt; Save As…), but if you want to save it as a .png file, just go to File &gt; Export As… instead.The final result can be seen here (feel free to use it !) : Download Tips and tricks If you want to easily change all colors, follow these steps : Hit CTRL + A to select the whole canvas Hit CTRL + SHIFT + C to copy all layers as one single merged layer Hit CTRL + SHIFT + V to copy into a new composition/tab Go to Colors &gt; Colorize, and play with the Hue. You can use another color for your lock screen, or simply lower the Saturation Conclusion This was a big post, and I hope you were able to follow along. If not, don’t hesitate to ask questions in the comments below (you need a (Disqus)[https://disqus.com/] account, but you can create one directly by using your Google, Twitter of Facebook account).I also hope that you have learned a bit more how to use Gimp. Feel free to try the same things in any other software of your choice (Photoshop for example). You can also share your own creations if you want.Note : You can use the final wallpapers whenever and wherever you want.","categories":[{"name":"Design","slug":"Design","permalink":"http://kynesilverhide.github.io/categories/Design/"},{"name":"Gimp","slug":"Design/Gimp","permalink":"http://kynesilverhide.github.io/categories/Design/Gimp/"}],"tags":[{"name":"gimp","slug":"gimp","permalink":"http://kynesilverhide.github.io/tags/gimp/"},{"name":"material","slug":"material","permalink":"http://kynesilverhide.github.io/tags/material/"},{"name":"design","slug":"design","permalink":"http://kynesilverhide.github.io/tags/design/"},{"name":"tutorial","slug":"tutorial","permalink":"http://kynesilverhide.github.io/tags/tutorial/"},{"name":"wallpaper","slug":"wallpaper","permalink":"http://kynesilverhide.github.io/tags/wallpaper/"}]},{"title":"Recommended packages for Atom","slug":"Recommended-packages-for-Atom","date":"2016-12-06T19:09:32.000Z","updated":"2016-12-08T19:21:42.722Z","comments":true,"path":"2016/12/06/Recommended-packages-for-Atom/","link":"","permalink":"http://kynesilverhide.github.io/2016/12/06/Recommended-packages-for-Atom/","excerpt":"If you have read my previous article, you may have chosen to give Atom a try.The best way to describe what Atom is, is to quote its website (https://atom.io/): Atom is a text editor that’s modern, approachable, yet hackable to the core—a tool you can customize to do anything but also use productively without ever touching a config file. Atom works. It’s simple, yet very powerful. It relies on community plugins to extend its base features. Ah, and it’s available on Windows, Mac and Linux (meaning you don’t have to follow all three previous tutorials on Ubuntu to test it). In this article, I’ll show you some of the best plugins (called packages) that you definitively should check out.","text":"If you have read my previous article, you may have chosen to give Atom a try.The best way to describe what Atom is, is to quote its website (https://atom.io/): Atom is a text editor that’s modern, approachable, yet hackable to the core—a tool you can customize to do anything but also use productively without ever touching a config file. Atom works. It’s simple, yet very powerful. It relies on community plugins to extend its base features. Ah, and it’s available on Windows, Mac and Linux (meaning you don’t have to follow all three previous tutorials on Ubuntu to test it). In this article, I’ll show you some of the best plugins (called packages) that you definitively should check out. If you are starting Atom for the first time, you’ll probably see this welcome screen. It will basically summarize the first steps you can take in Atom : Open a Project : This will open the project tree on the left, and set it as your workspace Install a Package : This is the main topic we will discuss later on. Packages are extensions that can add features, shortcuts, etc. Even the core features of Atom are bundled as packages, making it very modular and hackable. Choose a Theme : Themes will allow you to customize Atom, from the editor colors to the button skins. In the previous screenshots, I was using the default One Dark theme. Customize the sytling : If you want very deep customization of the interface, you can even add your own CSS. Hack on the Init Script : You can use it to change the behavior of Atom by editing the startup script Add a Snipper : Create you own code snippets to generate code from a predefined prefix. Learn Keyboard shortcuts : This should be self-explanatory. All IDE comes with lots of key-bindings, and learning them is often a good idea. Themes Themes can be install by opening the Edit &gt; Preferences Menu, and then going into the Install section. Don’t forget to click on “Themes” when searching by names. One-Light For those that don’t like dark themes, here is the default One-Light theme. I was a big fan of light themes when I started coding. Then I discovered IntelliJ and its Darkula Theme, and it was love at first sight. This is a major improvement from Eclipse‘s dark themes (they just don’t work… too much contrast maybe) Atom-Material After some customization (no custom CSS, I only used the configuration screen installed with the theme), this is what I came up with using the “Atom-Material-UI” theme. If you are not familiar with Material Design (by Google), I recommend you to read this article : http://design.google.com/resources Packages Based on what you will mostly use Atom for, you may need very different packages. I’ll try to cover a bit of everything by showing you what packages I’ve installed. Installation is done similarly to Themes, by switching to Packages before searching. Markdown Writer As I’m using Markdown syntax to write this blog, this package was one of my top priority. It allows to automatically insert elements, tables, etc by using the packages menu. Note that by default, Atom includes a markdown preview package that will show you a live preview of what you are typing. Atom Hexo Sometimes, I feel lazy and I don’t want to switch to the terminal. This package will allow me to trigger some of the Hexo commands within Atom. If you want more integration, you’ll find another alternative below. File Icons File-icons gives more “life” to you project files by using improved and colored icons. Here is a comparison with and without the plugin. Minimap I’m not personaly using it, but some people likes to have a small scrollable view of their code. That’s exactly what this package does. Pigments Pigment is very useful for CSS developers. It will actually show the color behind each color codes. By default, It will look like the left picture.But I like it a bit more subtle, so I’ve changed the configuration to use the gutter mode instead. Terminal plus Terminal-Plus will embed your Ubuntu terminal inside Atom. This means you’ll have access to the same commands in your editor. Unfortunately, the last version is bugged, so you’ll need to follow these instructions once the package has been installed First, we’ll need to edit ~/.atom/packages/terminal-plus/package.json Then, replace &quot;pty.js&quot;: &quot;git+https://github.com/jeremyramin/pty.js.git#28f2667&quot;With &quot;pty.js&quot;: &quot;git+https://github.com/jeremyramin/pty.js.git&quot; Now, you just have to type in these commands : 123 cd ~/.atom/packages/terminal-plus/npm installapm rebuild Restart Atom, and it should work as below. Note : the installation guide tells you to install node-gyp first (it’s a dependency). Simply open a terminal and type 1 npm install -g node-gyp Complete instructions are available here : https://github.com/nodejs/node-gyp#installation (I didn’t need to install the other dependencies though…) BONUS : Active Power Mode This very important packages will bring more satisfaction to every letters you type in your code. I recommend to have 3D acceleration for a more smooth experience. Conclusion I hope that you liked this post, and that I gave you some motivation to test Atom.For now, this is my favorite editor at home, for my personal projects (at work, I’m using IntelliJ Ultimate, but I don’t have to pay it myself. At home, a free alternative is more than welcome).We will probably meet again soon in the next post, where I will show you some tricks with Gimp !","categories":[{"name":"Programming","slug":"Programming","permalink":"http://kynesilverhide.github.io/categories/Programming/"},{"name":"Atom","slug":"Programming/Atom","permalink":"http://kynesilverhide.github.io/categories/Programming/Atom/"}],"tags":[{"name":"atom","slug":"atom","permalink":"http://kynesilverhide.github.io/tags/atom/"},{"name":"packages","slug":"packages","permalink":"http://kynesilverhide.github.io/tags/packages/"},{"name":"development","slug":"development","permalink":"http://kynesilverhide.github.io/tags/development/"},{"name":"code","slug":"code","permalink":"http://kynesilverhide.github.io/tags/code/"}]},{"title":"Discovering and installing Ubuntu in VirtualBox P3","slug":"Discovering-and-installing-Ubuntu-in-VirtualBox-P3","date":"2016-12-03T10:58:35.000Z","updated":"2016-12-08T17:56:06.427Z","comments":true,"path":"2016/12/03/Discovering-and-installing-Ubuntu-in-VirtualBox-P3/","link":"","permalink":"http://kynesilverhide.github.io/2016/12/03/Discovering-and-installing-Ubuntu-in-VirtualBox-P3/","excerpt":"Here we are, at the third and last part of this guide. In this post, I’ll try to cover what programs you can use for most of your tasks, but also give you an introduction to the terminal. Please keep in mind that we didn’t install Ubuntu to replace Windows : we are working in a virtual environment, meaning we can’t expected to play games (we even disabled 3D acceleration…). Focus will be done on development : web browsing, coding, files and pictures editing, etc. Let’s dive right into it !","text":"Here we are, at the third and last part of this guide. In this post, I’ll try to cover what programs you can use for most of your tasks, but also give you an introduction to the terminal. Please keep in mind that we didn’t install Ubuntu to replace Windows : we are working in a virtual environment, meaning we can’t expected to play games (we even disabled 3D acceleration…). Focus will be done on development : web browsing, coding, files and pictures editing, etc. Let’s dive right into it ! Applications Applications on Linux systems are similar to Windows or OSX applications. But not all of them exists on Linux. I’ll split this section into themes, and show you alternatives to what you were used to.Also, installing applications is very easy. Just start the Ubuntu software applications (from the left menu, or by using the global search), search for what you want, and click Install. You can also browse by categories if you don’t know the name of your application. Lastly, if you can’t find something, Google is still a valid option to find what you are looking for. Some applications are not available through the repositories, and are instead distributed as .deb files (Debian packages). Web browsing Unless you are coming from OSX (but in that case, you should probably stick to it, it may be the best operating system for developers… if you are willing to pay the price), you shouldn’t have problems to find what you want. Firefox : Firefox is the default web browser in Ubuntu. It’s very fast, powerful, you can install plugins to use even more features, and its debugging tools are very powerful. Chromium : Chrome itself is not available on Ubuntu, but Chromium is. To quote their website : The Chromium projects include Chromium and Chromium OS, the open-source projects behind the Google Chrome browser and Google Chrome OS. If you were using any of these two on Windows, you can just sign in to keep your bookmarks and plugins synchronized. If you were using Internet Explorer before… you should really try any of these two alternatives. They are just better in every single aspects. Even on Windows. Text Editor The basic text editor on Ubuntu is called Gedit. It’s similar to Notepad++, and support plugins to add more features. If you want something more advanced, I’ll give you some alternatives (that I’m using) in the Coding section. If you want to show the world how awesome you are at using very complex tools, I suggest you to try VIM or Emacs. But if, like me, you are not ashamed of using an IDE (Integrated Development Environment), you should find what you are looking for in the next sections. Picture editor Well, unfortunately, Photoshop is not available on Ubuntu. Instead, you have GIMP. While not as powerful, GIMP can do lots of things, and also supports plugins to have access to more features. I may do a quick tutorial on GIMP in the future, but I’m not an expert. You can find some basic and more advanced tutorials here : https://www.gimp.org/tutorials/ Music If you want to listen to music while coding (or not), you can use the default program called Rhythmbox. I, myself, prefer to use web players, such as Google Music. If you are a Spotify user, there is a version for Ubuntu (and also a web player on their website). To install it, you’ll need to type some commands in the terminal : https://www.spotify.com/be-nl/download/linux/. Don’t worry if you don’t understand them yet. Videos While there is a default applications for videos, I suggest to use VLC, because it supports nearly all existing formats by default (you don’t need codecs). Code/IDE If you have done a bit of research, you should know that one of the best IDE for Java is IntelliJ. It can supports a lot of other languages (HTML, CSS and Javascripts are supported by default, but you’ll also get support for Kotlin, Groovy, Scala, Maven, Ant, Git, SVN, Mercurial, CVS, Typescript, Android development, and much more). It also works on Windows, OSX and Ubuntu. BUT, the Ultimate version is not cheap.If you want to install it, you’ll have to go to their website and download the compressed archive : https://www.jetbrains.com/idea/download/#section=linux. Unpack it somewhere on your computer (you can right click the downloaded file to extract), open a terminal, go to the extracted directory (see last section) and type 1 ./idea.sh A free, and very powerful alternative (that I’m using) is Atom, a text editor developed by the Github team. It comes with a lot of features, supports lots of plugins, themes, and high customization.I will probably do a dedicated post to show you some of the best packages you can use. For example, it can integrate the Hexo commands to generate and serve your blog files (see my first post) Other applications Windows Ubuntu Comment Outlook Thunderbird But you should really consider creating a Gmail address from Google Microsoft Office Libre Office This set of applications will maintain as much compatibility as possible, but they definitively lack some features FileZilla, FTP Clients FileZilla But the default file explorer can also connects to FTP servers if you type the URL in the adress bar Putty Terminal Just type ssh username@host.com WinSCP File Explorer (Nautilus) Same as the FTP client Torrent clients Transmission Very basic, but it works Skype Skype https://www.skype.com/en/download-skype/skype-for-linux/ You can find even more alternatives here : http://askubuntu.com/questions/389228/what-default-windows-software-alternatives-does-ubuntu-have Accessing files from the host (Windows) Ok, so let’s get back to our virtual machine. As I said, Ubuntu is running inside a “box”. You can’t really access anything outside this box, unless you asks VirtualBox for some help.To do this, simply open the VirtualBox menu, and open the Shared Folders configuration Simply add a new shared folder, browse to the location, and don’t forget to check “automount” and “make permanent” If you open the file explorer in Ubuntu, you should now see a new entry on the leftUnfortunately, you probably can’t access it right now, because VirtualBox only allows the root account to access this folder. The easiest solution I found was to open a Terminal, and add yourself in the virtualbox (vboxsf) group, to have full access to this folder (replace “username” with your ubuntu login) 1 sudo usermod -G vboxsf -a username Reboot the machine, and you should now have access to your windows files. Terminal What is it? “Under Linux there are GUIs (graphical user interfaces), where you can point and click and drag, and hopefully get work done without first reading lots of documentation. The traditional Unix environment is a CLI (command line interface), where you type commands to tell the computer what to do. That is faster and more powerful, but requires finding out what the commands are.” The terminal can be seen as a more powerful version of Windows “cmd”. More powerful also means more “dangerous”, but don’t worry, you won’t break your environment so easily. What can I do with it? Pretty much everything. Using the terminal, you can install applications, update your system, edit and search for files, automate tasks, and much more.In this last section, I will show you some very basic commands (some of them may be similar or identical to the Windows ones) cd cd can be used to open a directory. Let’s say you want to open your home directory (that’s basically “My documents” from Windows), you can simply type 1 cd /home/username or use this shortcut 1 cd ~ If you want to go “up” a directory, use ... If you want to reference the current directory, use . 1 cd ../../Dev/java/ pwd pwd is not related to the password (that’s actually passwd), but instead, it will print the current directory 12 kyne@kyne-VirtualBox:~$ pwd/home/kyne ls ls prints the content of a directory. Options -la will print more details. 1234567891011 kyne@kyne-VirtualBox:~$ ls -latotal 244drwxr-xr-x 36 kyne kyne 4096 déc 4 15:17 .drwxr-xr-x 3 root root 4096 nov 12 20:03 ..drwx------ 3 kyne kyne 4096 nov 27 12:05 .adobedrwxr-xr-x 2 kyne kyne 4096 nov 12 20:35 .androiddrwxr-xr-x 9 kyne kyne 4096 nov 27 16:02 .atomdrwxr-xr-x 2 kyne kyne 4096 nov 12 20:24 .babel-cache-rw------- 1 kyne kyne 7152 déc 4 15:16 .bash_history-rw-r--r-- 1 kyne kyne 220 nov 12 20:03 .bash_logout-rw-r--r-- 1 kyne kyne 3754 nov 27 19:38 .bashrc You can filter the results using pipes. Pipes can be very complex, so I won’t cover that in this post. Basically, pipes sends the result of a command to the next command (if you have worked with Angular) before, it’s basically the same as the Angular pipes. Well, technically, it’s the other way around).The pipe we will use here is grep. It can be used to filter texts, even by using regular expression. If you want to list all PNG files inside a folder : 1 ls /home/kyne/Images | grep &quot;.png&quot; rm rm will remove a file or directory. Be careful with the “recursive” -R version, as it will remove everything inside the target. The most dangerous option is the combination of “recursive” and “force” -f. If you run it on the root folder, using the administrator account, you can simply destroy your entire system. So always check twice the command you will run. 1 rm /home/kyne/tmp/file.txt sudo Ubuntu use accounts to login into the system. But there is one account that acts as the administrator. This account is always called root, and can be required to perform some tasks, such as installing applications of updating the system. To switch to the root account, you can type 1 sudo su This will prompt you for your password. That means users can become administrator using their own password (this can be disabled on servers to increase the security).If you want to run a command as root, simply prefix it with “sudo” 123456789 kyne@kyne-VirtualBox:~$ ls /root -lals: cannot read directory &apos;/root&apos;: Permission deniedkyne@kyne-VirtualBox:~$ sudo ls /root -latotal 48drwx------ 10 root root 4096 déc 1 19:25 .drwxr-xr-x 24 root root 4096 nov 30 19:41 ..-rw-r--r-- 1 root root 3106 oct 22 2015 .bashrcdrwx------ 4 root root 4096 déc 2 17:04 .cachedrwxr-xr-x 6 root root 4096 déc 1 19:23 .config Update the system Updating your applications is very easy, and takes only two steps.The first one will update all repositories, to ensure they are using the last version of all packages. 1 sudo apt-get update Then, you can start the upgrade by running 1 sudo apt-get upgrade Installing an application Installing an application only requires you to know its package name. 1 sudo apt-get install firefox To search for a package, you can use this command 1 apt-cache search keyword To remove an application, simply type 1 sudo apt-get remove firefox Starting an application Usually, you can start an application from the terminal. For example, if you want to quickly edit a file with Gedit 1 gedit /home/kyne/Dev/web/blog/_config.yml Or you can open Atom and set your workspace as the current directory 12 cd /home/kyne/web/blogatom . Conclusion I think we have covered a lot of stuff today. There is still much to cover, but I think you now have enough basic knowledge to continue on your own.You will find plenty of tutorials and forums around the web to help you use Ubuntu.In the next tutorials, we will probably learn more about Atom, and I may also do a quick tutorial on GIMP.","categories":[{"name":"Operating System","slug":"Operating-System","permalink":"http://kynesilverhide.github.io/categories/Operating-System/"}],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://kynesilverhide.github.io/tags/ubuntu/"},{"name":"virtualbox","slug":"virtualbox","permalink":"http://kynesilverhide.github.io/tags/virtualbox/"},{"name":"unity","slug":"unity","permalink":"http://kynesilverhide.github.io/tags/unity/"},{"name":"unix","slug":"unix","permalink":"http://kynesilverhide.github.io/tags/unix/"}]},{"title":"Discovering and installing Ubuntu in VirtualBox (Part 2)","slug":"Discovering-and-installing-Ubuntu-in-Virtual-Box-P2","date":"2016-11-30T18:41:26.000Z","updated":"2016-12-02T15:54:01.078Z","comments":true,"path":"2016/11/30/Discovering-and-installing-Ubuntu-in-Virtual-Box-P2/","link":"","permalink":"http://kynesilverhide.github.io/2016/11/30/Discovering-and-installing-Ubuntu-in-Virtual-Box-P2/","excerpt":"Welcome back to the second part of this tutorial. We’ll continue right were we left. In this second part, we’ll install Ubuntu and do some last tweaks to our installation.At the end of this post, you should have a working virtual operating system. Note : I’ll do a third (and final) part to help your learn and configure Ubuntu. Let’s get going !","text":"Welcome back to the second part of this tutorial. We’ll continue right were we left. In this second part, we’ll install Ubuntu and do some last tweaks to our installation.At the end of this post, you should have a working virtual operating system. Note : I’ll do a third (and final) part to help your learn and configure Ubuntu. Let’s get going ! Installation Installing Ubuntu is very easy. It’s probably the easiest installation of all Unix systems. Everything is done using a graphical interface, were you just have to answer some questions and hit “continue” (yes, that’s very Windows-like). To start with, select your image in Virtual box, and click start (or double-click on the image). This will ask for the start-up disk. Just click on the yellow folder (with a green arrow), and browse to the downloaded .iso file. Then, click Start. The install software will start loading by itself… … until you see what looks like a basic desktop. Don’t worry too much if the resolution is small, you should be able to resize the window. You are presented with two options. Try Ubuntu : This will run a live version of Ubuntu, but any changes you do will be lost on reboot. It can be used to test Ubuntu on your computer without installing anything (Note : it can also be used to restore or recover files from an OS that won’t boot.. as long as your computer is running properly) Install Ubuntu This is the option we will use Check both options to allow Ubuntu to install updates and some third-party softwares to handle proprietary formats (such as MP3 files, etc), then click on Continue. Choose the first option to use the whole disk (remember, it’s a virtual file on your disk, so you can’t destroy your files outside the virtual machine), and click Install Now. A popup will show you that two partitions will be created. One big partition using the ext4 filesystem, and one smaller Swap partition (it may be useless now that all computers have plenty of RAM, but older computers could still need this when the amount of physical RAM is full).Click on Continue. Next steps is easy, just select your timezone, and click on Continue. Choose your keyboard layout, and hit Continue. Now, you’ll have to choose a login and password. Ubuntu supports multiple accounts like most operating systems. Once it’s done, click Continue. This time, the real installation will start, and the files will be copied onto the virtual disk. You can read what’s on screen to learn a bit more about Ubuntu, or just grab a cup of coffee until the process is finished. Once the installation is complete, you’ll have to restart the virtual machine (not your computer). Ubuntu will ask you to hit ENTER and then remove the installation disk. Fortunately, VirtualBox will do that for you, and turn off the fake CD drive that was reading the ISO file. Once restarted, you should see the Ubuntu login screen. If you properly setup the keyboard, you should have no problem to selected your account and type your password. Note hat the “Guest Session” is similar to the “Try Ubuntu” option we saw before. Everything will be cleared out at the end of the session. Ok, some final tweaks before using our brand new system. First, we’ll install the Guest Additions by going into the VirtualBox menu, and clicking on “Insert Guest Additions CD image…”. This will allow some features between your computer and the virtual machine, such as a shared clipboard, etc. This will once again emulates a CD drive that will be automatically discovered by Ubuntu. Just click on Run when this popup shows. A terminal will start and display some logs. Just wait for the “Press Return to close this window” to show. Hit Enter and the terminal will close. Now, go to the VirtualBox menu, click Devices and enable the bidirectional clipboard. Then, restart Ubuntu by going to the top right icon (the “power icon that looks like a gear”) and shutdown the system. Now, reboot your operating system. And Voila, you have a fully operational operating system that can be used to work on your home development projects. Conclusion Using Ubuntu is not hard, but you will probably struggle a bit at the beginning. That’s why I will write a full third part to this guide to help you discover your new desktop. But here are some hints to help you wait the next post : If you press the “Windows” key (I think it’s the “Command” key on Mac…), a global search will be triggered. Yo can search for applications, files or configurations menu. You can also just click on the top left icon in the Unity menu. (the left bar with all the big icons) Firefox : Firefox is installed by default, and is a very functional web browser. On Ubuntu, it seems to work a bit better than Chromium (it’s the open-source web browser project from which Google Chrome draws its source code). So you can start browsing the Internet as usual Terminal : This is where you can type your commands. It’s actually very powerful, and can make you save a lot of time. We’ll use it later on to install more stuff. Files : The file explorer should also be available on the left, but you won’t have access to your Windows files for now. This will be covered in the next post. System configuration : This is similar to Windows “Control Panel”. Most of the configuration can be done there, from changing the wallpaper to switching to another keyboard layout. Ubuntu-software : This application can help you install new software, simply by searching for them by names. This is one major changes from Windows : in most Unix systems (if not all…), applications are hosted on repositories, and you can install them without having to look them up on the Internet. Some repositories have to be added manually (or enabled), and some applications are still distributed as .deb files (Debian packages), but they can be installed simply by double-clicking on them. Finally, you can switch to fullscreen mode in VirtualBox by hitting HOST-KEY + F. “HOST-KEY” is “Right CTRL” on Windows. Simply press the same keys to go back to windowed mode.","categories":[{"name":"Operating System","slug":"Operating-System","permalink":"http://kynesilverhide.github.io/categories/Operating-System/"}],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://kynesilverhide.github.io/tags/ubuntu/"},{"name":"virtualbox","slug":"virtualbox","permalink":"http://kynesilverhide.github.io/tags/virtualbox/"},{"name":"unity","slug":"unity","permalink":"http://kynesilverhide.github.io/tags/unity/"},{"name":"unix","slug":"unix","permalink":"http://kynesilverhide.github.io/tags/unix/"}]},{"title":"Discovering and installing Ubuntu in VirtualBox (Part 1)","slug":"Discovering-and-installing-Ubuntu-in-VirtualBox","date":"2016-11-30T18:41:26.000Z","updated":"2016-12-02T12:40:21.335Z","comments":true,"path":"2016/11/30/Discovering-and-installing-Ubuntu-in-VirtualBox/","link":"","permalink":"http://kynesilverhide.github.io/2016/11/30/Discovering-and-installing-Ubuntu-in-VirtualBox/","excerpt":"If you are working as a developer, if you have some technical background, or simply if you label yourself as a bit geeky, you are probably aware that Windows is not the only operating system in the world (this is especially true if you are reading this blog on a Mac). Even your smartphone is probably running on Android instead of Windows (Phone). Arguing about the best of them is pointless. Each one of them has pros and cons, from their price to their “user-friendliness”. My goal in this post will be to show you Ubuntu, a free and open-source operating system based on Linux, and convince you that it is a very solid alternative to Windows as a development environment, that it’s easy to setup, easy to use, and completely free. And to achieve that, I will show you how to install it without running a single command in terminal, and without any risk of losing your data. Note that this tutorial will be split into multiple posts. This one is the first part.","text":"If you are working as a developer, if you have some technical background, or simply if you label yourself as a bit geeky, you are probably aware that Windows is not the only operating system in the world (this is especially true if you are reading this blog on a Mac). Even your smartphone is probably running on Android instead of Windows (Phone). Arguing about the best of them is pointless. Each one of them has pros and cons, from their price to their “user-friendliness”. My goal in this post will be to show you Ubuntu, a free and open-source operating system based on Linux, and convince you that it is a very solid alternative to Windows as a development environment, that it’s easy to setup, easy to use, and completely free. And to achieve that, I will show you how to install it without running a single command in terminal, and without any risk of losing your data. Note that this tutorial will be split into multiple posts. This one is the first part. What is Ubuntu Ok, so first, you probably want to learn more about Ubuntu. Why did I choose this operating system (OS)? What does it do?I’ll start by quoting Wikipedia) : Ubuntu is a Debian-based Linux operating system for personal computers, tablets and smartphones where Ubuntu Touch edition is used; and also runs network servers, usually with the Ubuntu Server edition, either on physical or virtual servers (such as on mainframes) and/or with containers, that is with enterprise-class features; runs on the most popular architectures, including server-class ARM-based. Yes.. that seems very technical, and not useful at all. So let’s split this information. Linux is a UNIX-like operating system : it shares a common base with MacOS and other operating systems, but this one is based on a free and open-source model. Also, this is actually a very basic OS on top of which other elements are built. Debian is what we will call a Linux distribution. Simply put, it’s a set of programs packaged together to build a fully functional OS. We could install Debian as it is, but we want something a little bit more user friendly and “cool” Ubuntu is based on Debian. You could see it as some kind of an “experimental” version of Debian, with more updates and recent features. But fear not, it’s actually quite stable But what does it looks like? As you can see, this is not an obscure ASCII terminal in black and white, and it’s not the Matrix either. And why would I need it? As I said in the introduction, the goal is to install a very powerful development environment. Because let’s face it, while Windows will get the job done, it’s not the most efficient (it could actually be the worst of all) when it comes to pure development (especially coding). If you have read my first post on how to install Hexo, you probably saw that installing something on Mac and Linux (I will say “Linux” when I’m referring to Unix-based operating system that are not MacOS) is most of the time done by running the proper command, while windows requires a dedicated installer that won’t integrate everything as smoothly. I will always try to add alternatives for Windows users on my next posts, but you should really give Ubuntu a try if you want to invest some time in custom projects at home. Installation When installing Ubuntu, you basically have three options Installing it on top of windows, losing all your files and programs (if you own an old laptop that you were planning to trash for example, it could be the easiest solution) Installing it next to windows, by splitting your hard drive into two partitions (or more) Installing it in a virtual environment In this post, we’ll cover the third option and install VirtualBox to host our virtual OS.Just go to https://www.virtualbox.org/wiki/Downloads and choose the “Windows hosts” or “OSX (Mac) hosts” (if you are already on another Linux distribution, it’s also possible, but I think you already know all the details). Install VirtualBox as any other software and start it. Creating the machine The first step is to create a new virtual machine. Just click the “New” button in the top left corner.This will start an assistant to help you setup your virtual machine. Let’s do this together First, you’ll have to choose a name for your machine. Pick anything you want, but don’t forget to select the proper type and version (Linux and Ubuntu 64) Keep the default values for the memory, we’ll adjust it later. Click next, and choose to create a new virtual hard disk now. This will create a big file on your disk that contains the whole system. For every other steps, keep the default values. If you wish, you can use a “fixed sized” disk to create one single big file (I choose this option, but it may be harder to resize the disk later on). We’ll continue tweaking the machine once it’s created. For the disk size, I recommend using at least 10 Gb (But if you can afford the space, use 16 or even 20Gb). Tweaking the machine Once the machine is created, select it, and click on “Settings”. Go to System. For the RAM, I decided to use half my RAM (4Gb/8Gb). You shouldn’t need more than 4Gb anyway. Go to the next tab, and try to use as many CPUs as available (don’t go into the red part of the slider) Next tab. Use the same settings as the one from this screenshot. You can now open the Display section. Move the slider to the right until you reach 128mb.. or lower if your graphic card is old.Right now, I’ve disabled 3D acceleration because it causes some problem in a virtual environment (you can’t take screenshots for example).I also manually changed some configuration file to use 256Mb. Without 3D acceleration, I don’t think it will matter much, but if you want, simply edit the .vbox file (right click on your virtual machine and select “Show in Explorer”) with any text editor, and change the following row : 1 &lt;Display VRAMSize=\"256\" monitorCount=\"1\" accelerate3D=\"false\" accelerate2DVideo=\"false\"/&gt; Lastly, I only managed to have proper audio by using Intel HD Audio. You can try other settings if you want. What’s next ? I’m sorry, but we have reached the end of this first part. Don’t worry, next part will follow quickly.You now have a properly setup virtual machine, but it’s still empty. In the next post, we’ll install Ubuntu together, and I will keep my promise : we won’t use any terminal. To prepare for this next post, you can start downloading Ubuntu 64 here : https://www.ubuntu.com/download/desktopClick on Download, and then, decide if you want to pay or not by adjusting the sliders. Don’t feel ashamed to use it for free.You won’t need any additional software to use the download .iso file, VirtualBox will take care of it.","categories":[{"name":"Operating System","slug":"Operating-System","permalink":"http://kynesilverhide.github.io/categories/Operating-System/"}],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://kynesilverhide.github.io/tags/ubuntu/"},{"name":"virtualbox","slug":"virtualbox","permalink":"http://kynesilverhide.github.io/tags/virtualbox/"},{"name":"unity","slug":"unity","permalink":"http://kynesilverhide.github.io/tags/unity/"},{"name":"unix","slug":"unix","permalink":"http://kynesilverhide.github.io/tags/unix/"}]},{"title":"Hello World, and building your own blog","slug":"Hello-World","date":"2016-11-26T13:27:16.000Z","updated":"2016-11-29T20:08:53.788Z","comments":true,"path":"2016/11/26/Hello-World/","link":"","permalink":"http://kynesilverhide.github.io/2016/11/26/Hello-World/","excerpt":"Hi ! I’m Aurélien, but you’ll find me around on the web as Kyne, or KyneSilverhide. I’m a developer from Belgium (yes, we have beer and chocolate). I’ve recently learned about Hexo, a very powerful tool to build “static blogs”, using Markdown and some command lines. As most developers should know, the best way to test or learn something is by using it in a real project. That’s why I’ve decided to start this blog mostly about programming stuff, and technologies. In this very first post, I’ll show you how to install Hexo for you own blog, and host it on Github (for free, of course).Also, English is not my main language, so I hope everything will be as smooth as possible.","text":"Hi ! I’m Aurélien, but you’ll find me around on the web as Kyne, or KyneSilverhide. I’m a developer from Belgium (yes, we have beer and chocolate). I’ve recently learned about Hexo, a very powerful tool to build “static blogs”, using Markdown and some command lines. As most developers should know, the best way to test or learn something is by using it in a real project. That’s why I’ve decided to start this blog mostly about programming stuff, and technologies. In this very first post, I’ll show you how to install Hexo for you own blog, and host it on Github (for free, of course).Also, English is not my main language, so I hope everything will be as smooth as possible. Github Create your account Any developer should already know about Github. Basically, it will host your source code for free, and keep an history of changes using a version control system called Git (we may talk about this later…). Fortunately, you don’t need to know GIT in this case, because Hexo has already automated everything for you, so you can focus on writing content.So, head over to https://github.com/, create an account, and we’ll meet again in the next section. Creating your first repository Once your account is created, we’ll create a repository to store our website. But we won’t build a basic repository. Instead, we’ll use a “new” functionality from Github called Githut Pages. I won’t go into the details, but this will allow your blog (or website) to be accessible at “http://username.github.io“. As long as you only hosts static pages and assets (javascript, css, pictures…), everything is taken care of. Your repository must be called “username.github.io” (where username is your github username). From my experience, it’s seems case-insensitive.Once created, we’ll need to download it on your computer. And to achieve that, we need to install Git. For windows users, the installation can be downloaded here : https://git-scm.com/download/win For UNIX users, you should easily find the installation steps here : https://git-scm.com/download/linux For MAC users, head over to this page : https://git-scm.com/download/mac Once Git is installed, open a terminal (or Git-Bash on windows), and go to your workspace (If you don’t have one, just pick a folder somewhere on your computer) 123 cd /path/to/my/workspacegit clone https://github.com/username/username.github.iocd username.github.io (don’t forget to replace “username” with your github username) Using any text editor or IDE, create a new file called index.html inside the newly created folder, and fill it with anything your want (as long as it’s valid HTML.. of course) 12 &lt;h1&gt;Hello World&lt;h1&gt;This is my website hosted on Github pages And then, in order to publish everything on Github, we’ll need to type some GIT commands. Don’t worry, it’s the only time. 123 git add --allgit commit -m &quot;Initial commit&quot;git push -u origin master If you have already worked with any other VCS (Version Control System), these commands may look familiar. The main difference between Git and SVN or CVS is that you first have to “commit” your changes to a local repository, and then “push” everything to the remote server. You should now be able to access your website in your favorite web browser by accessing this URL : http://username.github.io Hexo Installing Node and NPM Ok, if you are still reading this, let’s continue with Node and NPM. NPM is nothing more than a package manager. It will help you install program, libraries, etc.. and handle dependencies. Go to https://nodejs.org/en/download/ and choose the proper installer for your operating system (Node comes with NPM installed). If you are using windows, you should continue using Git-Bash as your terminal (it emulates some features from Unix-based terminals). Cmder is another great terminal on Windows that you may consider using for this tutorial. Installing Hexo Once Node is installed, let’s finally start installing Hexo. (On UNIX environments, you will need to run this command as the administrator) 1 npm install hexo-cli -g Now, somewhere in your workspace, let’s setup a new folder that will contain your blog 1234 cd /path/to/my/workspacehexo init blogcd blognpm install Configuring the blog The first step is to change the basic configuration defined in _config.yml (by the way, .yml files, for YAML, are just plain text files using indentation to define the structure. With XML and JSON, these are the main formats for configuration files) 1234567891011 title: My awesome blogsubtitle: Made with Hexodescription: Some more textauthor: KyneSilverhidelanguage: entimezone: Europe/Brusselsurl: http://username.github.ioroot: /permalink: :year/:month/:day/:title/permalink_defaults: Everything else can be left with the default values. Creating a post Save the configuration file, and go back to the terminal. Let’s write our first post. 1 hexo new post &quot;My first post&quot; All your posts are created inside the source/_posts folder. Open the .md file (for Markdown) matching your post title, and edit it. 1234567 ---title: My first postdate: 2016-11-26 14:27:16tags: [blog]categories: [Blog]---This is my first post ! I'm so happy. Note : some themes may allow additional elements, such as a thumbnail, a banner, etc.Tags and categories may not be shown depending on your theme, but it seems to be a good practice to fill them. If you want to add multiple tags or categories, just put a , between each. Ok, now that we have some content, we want to preview it before deploying everything to Github. But if you remember right, Hexo is a tool used to build static blogs. This means we have to “build” our site first, using this simple command : 1 hexo generate You’ll see some files being created or updated, and then you are done. Now, let’s see a preview. Another great feature with Hexo, is that you don’t need to setup a web server such as Apache. You just have to run this command : 1234 hexo serverINFO Start processingINFO Hexo is running at http://localhost:4000/. Press Ctrl+C to stop. Open the given url http://localhost:4000 in your browser, and you should see your first post ! If you want to know more about the Markdown syntax that you can use in your posts, just head over to this Markdown CheatSheet.This syntax can also be used in some Wikis and other tools. Publishing it to Github If everything works fine, it’s time to show your blog to the world. Let’s start by some configuration. Open _config.yml, and change this part 1234 deploy: type: git repository: https://github.com/username/username.github.io.git branch: master Of course, you have to change “username” with your Github account.Don’t forget that you need to generate your blog content before deploying it. You have three options Manually generating and then deploying 12 hexo generatehexo deploy Using any of these two shortcuts 1 hexo generate --deploy 1 hexo deploy --generate During the deployment, you’ll be asked for your Github login and password. Fill them in, and the deployment process should continue.This will also remove the test index.html that we wrote at the beginning of this tutorial. Don’t worry, we won’t need it anymore. Your blog should now be accessible at http://username.github.io. Congratulations ! Conclusion Now that we have do so many awesome things (yes, auto-congratulation is very important as a developer), let’s take a step back and list what we have accomplished today. First, we have created a Github account to host our blog. But Github is also one of the best solution to host the source code of all your projects, so feel free to check their website. Then, we use some Git commands to send our test page to Github. Git is also a very famous tool (and my favorite VCS), but it can be hard to master, so I only scratched the surface in this blog. You should find some more tutorials on Github, or around the web. After this, we installed Node and NPM. If you are a web developer, you should already have these installed. There are so many libraries, projects and applications built on top of node, and available through NPM. But be aware that NPM seems to download the whole Internet each time you use it. The next step was to Install Hexo, and write some content. If you want to continue your blog, I recommend you to browse some of the Hexo Themes, learn more about Markdown, or read the Hexo Documentation Lastly, we published our blog to Github. Feel free to test it on your tablet or mobile phone too ! This concludes my first post. I hope that this tutorial have taught you something, or helped you somehow, and we’ll meet again in the next post !","categories":[{"name":"Programming","slug":"Programming","permalink":"http://kynesilverhide.github.io/categories/Programming/"},{"name":"Hexo","slug":"Programming/Hexo","permalink":"http://kynesilverhide.github.io/categories/Programming/Hexo/"}],"tags":[{"name":"blog","slug":"blog","permalink":"http://kynesilverhide.github.io/tags/blog/"},{"name":"hexo","slug":"hexo","permalink":"http://kynesilverhide.github.io/tags/hexo/"},{"name":"github","slug":"github","permalink":"http://kynesilverhide.github.io/tags/github/"},{"name":"git","slug":"git","permalink":"http://kynesilverhide.github.io/tags/git/"},{"name":"markdown","slug":"markdown","permalink":"http://kynesilverhide.github.io/tags/markdown/"},{"name":"node","slug":"node","permalink":"http://kynesilverhide.github.io/tags/node/"},{"name":"npm","slug":"npm","permalink":"http://kynesilverhide.github.io/tags/npm/"}]}]}